openfoam13/periodic_roughness/system/createPatchDict
FoamFile { version 2.0; format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches
(
    {
        name        bottom_rough;
        patchInfo   { type wall; }
        constructFrom set;
        set         roughFaces;
    }
);
