openfoam13/periodic_roughness/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/Parameters"
actions
(
    {
        name    roughFaces;
        type    faceSet;
        action  new;
        source  boxToFace;
        // Define your rough zone here! (xmin ymin zmin) (xmax ymax zmax)
        box     (5 -100 -100) (15 100 100); 
    }
    {
        name    roughFaces;
        type    faceSet;
        action  subset;
        source  patchToFace;
        patch   bottom;
    }
);

// ************************************************************************* //
